app/Controllers/Alternatif.php

    public function getKriteria()
    {
        if ($this->request->isAJAX()) {
            $kriteria = $this->kriteriaModel->findAll();
---
SELECT *
FROM `kriteria`

    public function getSubKriteria($kodeKriteria)
    {
        if ($this->request->isAJAX()) {
            $subKriteria = $this->subKriteriaModel->where('kode_kriteria', $kodeKriteria)->findAll();
---
SELECT *
FROM `sub_kriteria`
WHERE `kode_kriteria` = 'C9'