app/Controllers/Alternatif.php

    public function index()
    {
         // Cek apakah user sudah login
        if (!$this->session->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        // Ambil data user
        $userId = $this->session->get('user_id');
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '10'

    public function store()
    {
        if ($this->request->isAJAX()) {
            $data = [
                'kode_alternatif' => $this->request->getPost('kode_alternatif'),
                'nama' => $this->request->getPost('nama'),
            ];

            if ($this->alternatifModel->save($data)) {
                $alternatifId = $this->alternatifModel->getInsertID();
                $kodeAlternatif = $data['kode_alternatif'];

                // Save nilai alternatif for each kriteria
                $kriteriaList = $this->request->getPost('kriteria');
                if ($kriteriaList) {
                    foreach ($kriteriaList as $kodeKriteria => $subKriteriaId) {
                        if (!empty($subKriteriaId)) {
                            $nilaiData = [
                                'kode_alternatif' => $kodeAlternatif,
                                'kode_kriteria' => $kodeKriteria,
                                'sub_kriteria_id' => $subKriteriaId
                            ];
                            $this->alternatifNilaiModel->save($nilaiData);
---
INSERT INTO `alternatif` (`kode_alternatif`, `nama`, `created_at`, `updated_at`) VALUES ('A6', 'Azka', '2025-06-04 03:18:34', '2025-06-04 03:18:34')
INSERT INTO `alternatif_nilai` (`kode_alternatif`, `kode_kriteria`, `sub_kriteria_id`, `created_at`, `updated_at`) VALUES ('A6', 'C1', '2', '2025-06-04 03:18:34', '2025-06-04 03:18:34')

    public function getKriteria()
    {
        if ($this->request->isAJAX()) {
            $kriteria = $this->kriteriaModel->findAll();
---
SELECT *
FROM `kriteria`

    public function getSubKriteria($kodeKriteria)
    {
        if ($this->request->isAJAX()) {
            $subKriteria = $this->subKriteriaModel->where('kode_kriteria', $kodeKriteria)->findAll();
---
SELECT *
FROM `sub_kriteria`
WHERE `kode_kriteria` = 'C5'