app/Controllers/Auth.php

public function dashboard()
{
    // Cek apakah user sudah login
    if (!$this->session->get('logged_in')) {
        return redirect()->to('/auth/login');
    }

    // Ambil data user dari database
    $userId = $this->session->get('user_id');
    $user = $this->userModel->find($userId);

    // Hitung statistik
    $totalAlternatif = $this->alternatifModel->countAll();
    $totalKriteria = $this->kriteriaModel->countAll();
    $totalSubKriteria = $this->subKriteriaModel->countAll();

    // Hitung total penilaian (alternatif yang sudah dinilai)
    $alternatifDenganNilai = $this->alternatifNilaiModel
        ->select('kode_alternatif')
        ->groupBy('kode_alternatif')
        ->findAll();
    $totalPenilaian = count($alternatifDenganNilai);

    // Ambil 5 alternatif terbaru
    $recentAlternatif = $this->alternatifModel
        ->orderBy('created_at', 'DESC')
        ->limit(5)
        ->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '10'
SELECT COUNT(*) AS `numrows` FROM `alternatif`
SELECT COUNT(*) AS `numrows` FROM `kriteria`
SELECT COUNT(*) AS `numrows` FROM `sub_kriteria`
SELECT `kode_alternatif`
FROM `alternatif_nilai`
GROUP BY `kode_alternatif`
SELECT *
FROM `alternatif`
ORDER BY `created_at` DESC
 LIMIT 5