app/Controllers/KriteriaController.php

    public function index()
    {
        // Cek apakah user sudah login
        if (!$this->session->get('logged_in')) {
            return redirect()->to('/auth/login');
        }

        // Ambil data user untuk keperluan navbar
        $userId = $this->session->get('user_id');
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '10'

    public function getData()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setJSON(['error' => 'Invalid request']);
        }

        $search = $this->request->getPost('search')['value'] ?? '';
        $start = (int) $this->request->getPost('start') ?? 0;
        $length = (int) $this->request->getPost('length') ?? 10;

        $data = $this->kriteriaModel->getKriteriaPaginated($length, $start, $search);
        $totalRecords = $this->kriteriaModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `kriteria`