app/Controllers/MatrikKeputusanController.php

    public function getMatrikKeputusan()
    {
        // Ambil semua data alternatif dengan nilai bobot
        $alternatifNilai = $this->alternatifNilaiModel
            ->select('alternatif_nilai.kode_alternatif, alternatif_nilai.kode_kriteria,
                     sub_kriteria.bobot, sub_kriteria.sub_variabel, kriteria.variabel')
            ->join('sub_kriteria', 'sub_kriteria.id = alternatif_nilai.sub_kriteria_id')
            ->join('kriteria', 'kriteria.kode_kriteria = alternatif_nilai.kode_kriteria')
            ->orderBy('alternatif_nilai.kode_alternatif, alternatif_nilai.kode_kriteria')
            ->findAll();
---
SELECT `alternatif_nilai`.`kode_alternatif`, `alternatif_nilai`.`kode_kriteria`, `sub_kriteria`.`bobot`, `sub_kriteria`.`sub_variabel`, `kriteria`.`variabel`
FROM `alternatif_nilai`
JOIN `sub_kriteria` ON `sub_kriteria`.`id` = `alternatif_nilai`.`sub_kriteria_id`
JOIN `kriteria` ON `kriteria`.`kode_kriteria` = `alternatif_nilai`.`kode_kriteria`
ORDER BY `alternatif_nilai`.`kode_alternatif`, `alternatif_nilai`.`kode_kriteria`

public function getNormalisasiMatrik()
{
    // Ambil data dengan jenis kriteria
    $alternatifNilai = $this->alternatifNilaiModel
        ->select('alternatif_nilai.kode_alternatif, alternatif_nilai.kode_kriteria,
                 sub_kriteria.bobot, kriteria.jenis_kriteria, kriteria.variabel')
        ->join('sub_kriteria', 'sub_kriteria.id = alternatif_nilai.sub_kriteria_id')
        ->join('kriteria', 'kriteria.kode_kriteria = alternatif_nilai.kode_kriteria')
        ->orderBy('alternatif_nilai.kode_alternatif, alternatif_nilai.kode_kriteria')
        ->findAll();
---
SELECT `alternatif_nilai`.`kode_alternatif`, `alternatif_nilai`.`kode_kriteria`, `sub_kriteria`.`bobot`, `kriteria`.`jenis_kriteria`, `kriteria`.`variabel`
FROM `alternatif_nilai`
JOIN `sub_kriteria` ON `sub_kriteria`.`id` = `alternatif_nilai`.`sub_kriteria_id`
JOIN `kriteria` ON `kriteria`.`kode_kriteria` = `alternatif_nilai`.`kode_kriteria`
ORDER BY `alternatif_nilai`.`kode_alternatif`, `alternatif_nilai`.`kode_kriteria`