app/Controllers/NormalisasiController.php

SELECT *
FROM `kriteria`
---
    private function getKriteriaTypes()
    {
        $kriteria = $this->kriteriaModel->findAll();