app/Controllers/Preferensi.php

INSERT INTO `preferensi` (`kode_kriteria`, `bobot_preferensi`, `created_at`, `updated_at`) VALUES ('C7', '1', '2025-05-30 10:54:48', '2025-05-30 10:54:48')
---
    public function store()
    {
        if (!$this->request->isAJAX()) {
            return redirect()->back();
        }

        $rules = [
            'kode_kriteria' => 'required',
            'bobot_preferensi' => 'required|decimal|greater_than[0]' // ubah dari 'integer' ke 'decimal'
        ];

        if (!$this->validate($rules)) {
            return $this->response->setJSON([
                'success' => false,
                'errors' => $this->validator->getErrors()
            ]);
        }

        $data = [
            'kode_kriteria' => $this->request->getPost('kode_kriteria'),
            'bobot_preferensi' => $this->request->getPost('bobot_preferensi')
        ];

        if ($this->preferensiModel->insert($data)) {