app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '5'
---
    public function index()
    {
        $userId = session()->get('user_id'); // Sesuaikan dengan session Anda
        $user = $this->userModel->find($userId);