app/Controllers/SubKriteria.php

SELECT *
FROM `kriteria`
---
    public function getKriteriaOptions()
    {
        if ($this->request->isAJAX()) {
            $kriteria = $this->kriteriaModel->findAll();

DELETE FROM `sub_kriteria`
WHERE `id` IN ('7')
---
    public function delete($id)
    {
        if ($this->request->isAJAX()) {
            if ($this->subKriteriaModel->delete($id)) {