app/Models/AlternatifModel.php

SELECT COUNT(*) AS `numrows` FROM `alternatif`
SELECT COUNT(*) AS `numrows`
FROM `alternatif`
---
    public function getDataForDataTables($request)
    {
        $columns = [
            0 => 'id',
            1 => 'kode_alternatif',
            2 => 'nama',
        ];

        $totalData = $this->countAll();

        $builder = $this->builder();

        // Search functionality
        if (!empty($request['search']['value'])) {
            $search = $request['search']['value'];
            $builder->groupStart()
                   ->like('kode_alternatif', $search)
                   ->orLike('nama', $search)
                   ->groupEnd();
        }

        $totalFiltered = $builder->countAllResults(false);