app/Models/KriteriaModel.php

    public function getKriteriaPaginated($limit = 10, $offset = 0, $search = '')
    {
        $builder = $this->builder();

        if (!empty($search)) {
            $builder->groupStart()
                    ->like('kode_kriteria', $search)
                    ->orLike('variabel', $search)
                    ->orLike('jenis_kriteria', $search)
                    ->groupEnd();
        }

        return $builder->limit($limit, $offset)->get()->getResultArray();
---
SELECT *
FROM `kriteria`
 LIMIT 10

    public function countKriteria($search = '')
    {
        $builder = $this->builder();

        if (!empty($search)) {
            $builder->groupStart()
                    ->like('kode_kriteria', $search)
                    ->orLike('variabel', $search)
                    ->orLike('jenis_kriteria', $search)
                    ->groupEnd();
        }

        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kriteria`