app/Models/PreferensiModel.php

SELECT COUNT(*) AS `numrows` FROM `preferensi`
---
    public function getDataTable($request)
    {
        $builder = $this->db->table($this->table)
                           ->select('preferensi.*, kriteria.variabel')
                           ->join('kriteria', 'kriteria.kode_kriteria = preferensi.kode_kriteria');

        // Handle search
        if ($request['search']['value']) {
            $searchValue = $request['search']['value'];
            $builder->groupStart()
                   ->like('preferensi.kode_kriteria', $searchValue)
                   ->orLike('kriteria.variabel', $searchValue)
                   ->orLike('preferensi.bobot_preferensi', $searchValue)
                   ->groupEnd();
        }

        // Handle ordering
        if (isset($request['order'][0]['column'])) {
            $columns = ['', 'preferensi.kode_kriteria', 'kriteria.variabel', 'preferensi.bobot_preferensi', ''];
            $columnIndex = $request['order'][0]['column'];
            if (isset($columns[$columnIndex]) && $columns[$columnIndex] != '') {
                $builder->orderBy($columns[$columnIndex], $request['order'][0]['dir']);
            }
        } else {
            $builder->orderBy('preferensi.kode_kriteria', 'ASC');
        }

        // Get total records without filtering
        $totalRecords = $this->db->table($this->table)->countAll();

SELECT `kode_kriteria`, `variabel`
FROM `kriteria`
ORDER BY `kode_kriteria` ASC
---
    public function getKriteriaOptions()
    {
        $kriteriaModel = new \App\Models\KriteriaModel();
        return $kriteriaModel->select('kode_kriteria, variabel')
                           ->orderBy('kode_kriteria', 'ASC')
                           ->findAll();