app/Models/SubKriteriaModel.php

    public function getDataTables($request)
    {
        $builder = $this->db->table($this->table)
                           ->select('sub_kriteria.*, kriteria.variabel as nama_kriteria')
                           ->join('kriteria', 'kriteria.kode_kriteria = sub_kriteria.kode_kriteria');

        // Search
        if (!empty($request['search']['value'])) {
            $searchValue = $request['search']['value'];
            $builder->groupStart()
                   ->like('sub_kriteria.kode_kriteria', $searchValue)
                   ->orLike('sub_kriteria.sub_variabel', $searchValue)
                   ->orLike('kriteria.variabel', $searchValue)
                   ->orLike('sub_kriteria.bobot', $searchValue)
                   ->groupEnd();
        }

        // Order
        if (isset($request['order'])) {
            $columns = ['', 'sub_kriteria.kode_kriteria', 'kriteria.variabel', 'sub_kriteria.sub_variabel', 'sub_kriteria.bobot', ''];
            $orderColumn = $columns[$request['order'][0]['column']] ?? 'sub_kriteria.id';
            $orderDir = $request['order'][0]['dir'] ?? 'asc';

            if ($orderColumn !== '') {
                $builder->orderBy($orderColumn, $orderDir);
            }
        }

        // Count total records
        $totalRecords = $this->db->table($this->table)
                                ->join('kriteria', 'kriteria.kode_kriteria = sub_kriteria.kode_kriteria')
                                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `sub_kriteria`
JOIN `kriteria` ON `kriteria`.`kode_kriteria` = `sub_kriteria`.`kode_kriteria`